# #  a 代表变量名, = 代表赋值符，表示把右边的值存到左边的位置
# #  字符串有四种表达方法,"第一种" '第二种' '''第三种''' """第四种"""
# #  a = '''这是一个字符串'''
# #  print( )在控制台打印，type( )显示变量存的数据类型
#
#
# a="fjgkfgj"
# print(type(a))
#
# b=111
# print(type(b))
# print(b)
#
# # [] 表示list代表一个列表，可以存多个数据，多个数据中间用"," 隔开
# c=[1,2,3,4]
# print(type(c))
# print(c)
#
# # （）表示tuple代表一个元组,可以存多个数据，多个数据中间用"," 隔开
# d=(1,2,3,4)
# print(type(d))
# print(d)
#
# #  键值对数据 姓名：薛鹏垒 手机号:13671892782
# #  { }表示dict 代表一个字典，可以存储多个键值对数据，多个键值对中间用"," 隔开，key 和value 用";" 隔开
#
# e={"姓名":"薛鹏垒","手机号":"13671892782","性别":"男"}
# print(type(e))
# print(e)
#
# f={"张三","李四","王五","赵六","钱七"}
# print(type(f))
# print(f)
#
# g={"姓名":"张三","年龄":18,"性别":"女","科目":"语文","成绩":80}
# print(type(g))
# print(f)
#
# h=("A",5,6,7,8,9,"J","Q","K")
# print(type(h))
# print(h)
#
# i=10000
# print(type(i))
# print(i)
#
# j="学生"
# print(type(j))
#
#
# #小明同学有20块钱，红双喜10块钱，玉溪25块钱，大前门5块钱，求出小明可以买那种烟
# x=20
# if(x>=10):
#         print(x,"元可以买红双喜")
# if(x>=25):
#         print(x,"元可以买玉溪")
# if(x>=5):
#         print(x,"元可以买大前门")
#
# #成人票 200 12岁以下的小孩票100 60岁以上的老人票 150 小明今年18岁，去买票应该买那种票？
#
# a=18
# if(a>60):
#         print("小明需要买老年票")
# elif(a>18):
#         print("小明需要买成人票")
# else:
#         print("小明需要买未成年票")

# for i in range(50):
#     if(2*i+1<100):
#         print(2*i+1)
#
# print(10,'\t',end='')
# print(10,'\t')



# for i in range(1,10):
#     for j in range(1,i+1):
#         print(j,'*',i,"=",i*j,'\t',end='')
#     print()
# b=1
# for i in [90,100,98,84]:
#     if(i<80):
#         b=2
# if(b==1):
#     print("成绩优秀")
# else:
#     print("成绩不全优秀")

#求1-100之间的质数
# for i in range(2,100):
#     for m in range(2,i):
#       if(i%m==0):
#         a=0#a是合数
#     i
#         print("a是合数")
#     else:
#         print("a是质数")
# "01010010001110001001001010101010010101" #计算下几个0 几个1
# a="01010010001110001001001010101010010101"
# x=0
# b=0#b代0
# c=0#代表1
# for i in a:
#    if(i=="0"):
#        b=b+1
#    else:
#        c=c+1
#
# print('有',b,'个1','有',c,'个')

# ##求1+2+3+4...+100
# i=1
# s=0
# while(i<=100):
#     s=s+i
#     i=i+1
# print(s)

#求出10的阶乘
# i=1
# s=1
# while(i<=10):
#     s=s*i
#     i=i+1
# print(s)
#
# a="4523456789"
# print(a[0:3])
# print(a[5:6])
# print(a[-5:-2])
# 按照扑克牌的规则，现在有6张牌，只要5张
# 黑桃（S）红桃（H）方块（D）梅花（C）
# 牌：2.3.4.5.6.7.8.9.10.J.Q.K.A
# # 数据库存的是下面格式的数据，写脚本验证满足3带2的牌型
# # # [''D1'' , ''H1'' , ''H10'' , ''H7'' , ''S1'' , ''S7'']
# # ["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]
# #
# # a='''["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]'''
# # a = a[1:-1]
# # a_li = a.split(" , ")
# # print(a_li)
#
# a='''["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]'''


# a='https://baijiahao.baidu.com/s?id=1605684471000597023&wfr=spider&for=pc'
#
# xieyi= a.split('://')[0]
# a = a.split('://')[1]
# print(xieyi)
#
# yuming=a[:a.find('/')]
# print(yuming)
#
# uri = a[a.find('/'):]
# print(uri)

# #创建
# a = []
# #列表最后新增单个值
# a.append(1)
# a.append("jjkk")
# print(a)
#
# #合并
# b = [2,5,8,6]
# #使用+合并两个列表,(生成一个新的列表
# print(a+b)
# print(a)
#
# #使用extend合并两个列表
# a .extend(b)
# print(a)

# #删除
# #根据下标删除某个元素
# a.pop(0)
# print(a)
# #默认删除列表中最后一个元素
# #清空一个列表
# a = []
# print(a)
# a.clear()
# print(a)
#
# #改
# #根据下标中修改某个元素的值
# a[0]=0
# a[1]=4
# #等价
# a[0],a[1]=0,4

#查
#根据下标中查询某个元素的值
# print(a[0])
# print(a[1])
#遍历借助循环
# for i in a:
#     print(i)

#截取
#截取部分数据
print(a[1:3])
#倒序
print(a[::-1])
#隔一个取一个
print(a[::2])

#成员判断
if(5 in a):
    print("存在列表中")
else:
    print("不存在列表中")



































